using System;

namespace ZadachiVideo07
{
	class MainClass
	{
		public static void Main (string[] args)
		{
			//         Видео 06 Задачи:
			//
			//			  1.Да се напише програма, която създава масив с 20 елемента от целочислен тип и инициализира 
			//			всеки от елементите със стойност равна на индекса на елемента, умножен по 5. 
			//			Елементите на масива да се изведат на конзолата. (Hint: Използвайте масив int[] и for цикъл.)
			//			  2.Да се напише програма, която чете два масива от конзолата и проверява дали са еднакви. 
			//			(Hint: Два масива са еднакви, когато имат еднаква дължина и стойностите на елементите в тях 
			//			съответно съвпадат.)
			//			  3.Да се провери дали един масив е симетричен. (Hint: За да проверим дали масивът е 
			//			симетричен, трябва да го обходим само до средата. Тя е елементът с индекс array.length / 2. 
			//			При нечетна дължина на масива този индекс е средният елемент, а при четна – елементът 
			//			вляво от средата, понеже средата е между два елемента.)
			//			  4.Да се дефинира масив, като стойностите да се прочитат от командния ред. 
			//			След това тези стойности в масива да се изведат в обратен ред


			//////			Задача 1
			//////
						int [] Z1 = new int[20];
						for (int j =0; j<20; j++) {
							Z1 [j] = j*5;
						}
						for (int j = 0; j < 20; j++) {
							Console.WriteLine ("За елемент " + j+ " от масива цифрата е: " + Z1 [j]+";");
						}
			
						Console.WriteLine ("\n");
			
						for (int j = 0; j < 19; j++) {
							Console.Write (Z1[j]+";");
						}
						Console.Write (Z1 [19]);
			
						Console.WriteLine ("\n" + "---------" + "\n");
			
						// Решение на колега от форума
						int[] input = new int[21] { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20};
						for (int i = 0; i < input[20]; i++)
						{
							int multi;
							multi = 5 * input[i];
							Console.Write("{0},",multi);
						}
						Console.ReadLine();

			
			
			
			//			ЗадаLine ("Задача 2");
						int [] Z2a = new int[10];
						for (int j1 =0; j1<10; j1++) {
							Z2a [j1] = j1*5;
						}
			
						int [] Z2b = new int[15];
						for (int j2 =0; j2<15; j2++) {
							Z2b [j2] = j2*5;
						}
			
						int d1 = Z2a.Length;
						int d2 = Z2b.Length;
			
			//			bool d3 = true;
			//			bool d3 = (d1 == d2);
			
			//			Console.WriteLine (d3);
			
						if (d1!=d2) {
							for (int x =0; x<20;x++) {
					//					bool st = true;
					//					st = (Z2a [x] != Z2a [x]);
			
								if (Z2a [x] != Z2a [x]) {
									Console.WriteLine("Масивите не са еднакви");
								}
									else {
										Console.WriteLine("Масивите са еднакви");
									}
							};
							Console.WriteLine("Масивите не са еднакви");
						}
			
		}
	}
}
